// 日记数据配置
// 用于管理日记页面的数据

export interface DiaryItem {
  id: number;
  content: string;
  date: string;
  images?: string[];
  location?: string;
  mood?: string;
  tags?: string[];
}

// 示例日记数据
const diaryData: DiaryItem[] = [
  /*	{
		id: 1,
		content:
			"The falling speed of cherry blossoms is five centimeters per second!",
		date: "2025-01-15T10:30:00Z",
		images: ["/images/diary/sakura.jpg", "/images/diary/1.webp"],
	},*/

  {
    id: 15,
    content:
      "3月份的时候，准备得比较早的同学已经开始考研了。我看到有同龄人开始投实习，想着不妨试试。在家里的支持下我从3月投到4月（中间甚至因为屡面屡挂哭过一次），终于拿到了唯一一张实习offer。5月初我来到深圳，这个时候大部分考研的同学都已经开始了。经过四个月的（近似）996，我感到非常疲惫也学不到新的东西，于是放弃了九月底的转正答辩，在八月的最后一天飞回成都。九月的第一周和朋友们每日吃喝，精神恢复了不少。然后开始准备考研了（如果是准备秋招的话我一定会留到九月参加转正答辩再走），差不多从9月7日开始学数学，网课很多进度也很慢，三天才过完张宇高数第一讲，这个时候才感觉到三个月考研的压力非常之大，除非每天能有效学习8个小时才有希望考前学完所有课程。9号晚上群友们都鼓励我说放手一搏，不管再极限只要坚持下去就好，我当时很感动。但是到10号我的状态每况愈下，一天下来有效学习时间大概只有一个多小时，一边想的是“3个月真的能上岸吗，如果没希望的话不如明年年初再开始28考研？”一边想的是“何不试试秋招？以我现在的简历万一开出了大包不就不用读研了，反正读研出来也要工作，殊途同归而已。”于是在11日我联系了之前实习公司的leader（因为他在我走之前说如果我秋招还想来可以直通最终面，就相当于转正答辩了），当天就越好了14日的面试。11日晚我和朋友说我更新了我的计划：如果我能在秋招开出大包就去工作，否则就可以老老实实考研，如果考不上就再来一年。做出这个计划后当时一身轻松，出门和朋友吃了牛肉火锅。12日晚间和家里通了一个半小时的视频电话，聊了很多，大意还是说读了研之后平台更高，在社会上光环也更显然，但是他们又说一切尊重我自己的选择。这让我又陷入了纠结。如果我的父母是那种会说“你一定要读研”或者“你一定要早点出来工作挣钱”的父母，我可能不会在选择上浪费这么多时间。10号到12号差不多大厂该投的都投了，发来的笔试和性格测评也都做了，看看下周开始有没有新的面试。真正开始投简历之后又会觉得自己的本科学历比起同龄人的研究生还是低人一等，还是不甘心一辈子做本科生（可能这种心态也是有问题的）。我真的很想知道三年之后选择读研或者工作的我到底会不会后悔，但是把现在的心情寄托于未来是否有些奇怪？身边也不乏选择本科就业的同学，不知道他们是怎么想？现在已经是14日零点，还有十个小时就是那场最终面，如果挂掉的话我反而可能会轻松，如果给我发offer的话要不要选择去？到底给多少才去，给多少不去？我想不明白也不想再想，但是时间一直在走，时间从来不会停下来等我。https://chatgpt.com/share/6aa6cf39-a8d0-83e8-a73e-fcfad5b43dd3",
    date: "2026-09-13T16:00:00Z",
    images: [
      "/images/diary/20260914_1.jpg",
      "/images/diary/20260914_2.jpg",
      "/images/diary/20260914_3.jpg",
    ],
  },

  {
    id: 14,
    content: "我会发着呆，然后忘记你，接着紧紧闭上眼",
    date: "2026-09-08T12:28:00Z",
  },

  {
    id: 13,
    content: "沉默着走了有 多遥远",
    date: "2026-08-28T19:02:00Z",
    images: [
      "/images/diary/20260828_1.jpg",
      "/images/diary/20260828_2.jpg",
      "/images/diary/20260828_3.jpg",
    ],
  },

  {
    id: 12,
    content: "莫叹去日不可追，来日犹可为。",
    date: "2026-08-18T12:51:00Z",
  },

  {
    id: 11,
    content: "甲流阳了，已老实😭这两天已经好多了，前两天烧得几乎下不了床。",
    date: "2026-08-15T18:16:00Z",
    images: ["/images/diary/260816_1.jpg", "/images/diary/260816_2.jpg"],
  },

  {
    id: 10,
    content: "老实赚钱很枯燥吧？",
    date: "2026-08-03T15:31:00Z",
    images: ["/images/diary/260803.jpg"],
  },

  {
    id: 9,
    content: "台风天，不出门，吃炸鸡，打游戏，泡脚睡觉 :D",
    date: "2026-07-26T09:09:00Z",
    images: [
      "/images/diary/260726_122824.jpg",
      "/images/diary/260726_145922.jpg",
    ],
  },

  {
    id: 8,
    content:
      "有一年多没吃泡面了，中午特地开了一桶尝尝，但是没到晚上就已经饿得不行。图二为下午时候台风“红霞”过境，物业为一楼玻璃大门装上木架",
    date: "2026-07-25T12:54:00Z",
    images: [
      "/images/diary/260725_130407.jpg",
      "/images/diary/260725_181916.jpg",
    ],
  },

  {
    id: 7,
    content:
      "最近公司添置了冰柜，意外实现了雪糕自由。图中为今天下午公司投喂的巧乐兹",
    date: "2026-07-24T15:15:00Z",
    images: ["/images/diary/260724.jpg"],
  },

  {
    id: 6,
    content: "修建长城的人是觉得累还是自豪呢",
    date: "2026-07-23T13:59:00Z",
    images: ["/images/diary/260723.jpg"],
  },

  {
    id: 5,
    content: "书背完了，五猖会也结束了。",
    date: "2026-07-21T14:46:00Z",
    images: ["/images/diary/260721.png"],
  },

  {
    id: 4,
    content: "一杯水一支烟，一个波形测一天。下辈子一定要做研发不做测试。",
    date: "2026-07-14T13:09:00Z",
    images: ["/images/diary/260714.jpg"],
  },

  {
    id: 3,
    content:
      "可能是到深圳两个月以来天气最好的一天，天气非常晴朗，太阳高照，气温适宜，没有一点闷热的感觉。睡到十二点起来晒被子，这还是来之后第一次晒被子。想到KFC的大神卡只剩最后一天了，就点了一份双人餐当午饭。后面不会再续了，还是比堂食贵很多：一份常点的四件套堂食是27.9，外送32.9，看来免的外送费都加在了原价里。双人餐实在吃不下剩了四分之一，留到晚上七八点当晚饭吃了。今天没有去公司加班。昨天感觉到无聊的时候心情还蛮低落的，今天突然想到能感觉到无聊对于社畜来说也未免不是一件好事。下午一直在听音乐，今天都还算过得平平淡淡。",
    date: "2026-07-11T15:28:00Z",
    images: ["/images/diary/260711.jpg"],
  },

  {
    id: 2,
    content:
      "边实习边考研简直是我这段时间做过最荒诞的白日梦。上班的时候无论做什么都会经常被打断，几乎没有机会安安静静地坐在工位上做点事情；晚上八九点到家随便一下就到了十、十一点，不要说学习了，甚至游戏也有几周没有打开过。周末倒好，心里总惦记着那几百块加班费，时间也总是飞快地溜走，到今天为止考研都还没启动。",
    date: "2026-07-10T15:15:00Z",
    images: ["/images/diary/dog_0710.jpg"],
  },

  {
    id: 1,
    content:
      "给电路板烧录固件的同事说烧录不了，排查半天居然是直流电源的问题。优利德的UDP6731不行，换成6721就可以了。图片分别是6731和6721经过板上的降压电路后电压的纹波，也不知道这种脉冲波形是怎么来的，AI说是电源纹波抑制比不足导致电源纹波进入了后级。",
    date: "2026-07-09T13:22:00Z",
    images: ["/images/diary/UDP6731.jpg", "/images/diary/UDP6721.jpg"],
  },
];

// 获取日记列表（按时间倒序）
export const getDiaryList = (limit?: number) => {
  const sortedData = [...diaryData].sort(
    (a, b) => new Date(b.date).getTime() - new Date(a.date).getTime(),
  );

  if (limit && limit > 0) {
    return sortedData.slice(0, limit);
  }

  return sortedData;
};

// 获取所有标签
export const getAllTags = () => {
  const tags = new Set<string>();
  for (const item of diaryData) {
    if (item.tags) {
      for (const tag of item.tags) {
        tags.add(tag);
      }
    }
  }
  return Array.from(tags).sort();
};
